RuanJG/stm32_can_gps_hcm6343/Project/Yunzhou_remote(V1.1)/Core/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    11-November-2013
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "bsp.h"
#include "timers.h "
#include <stddef.h>
#include "TouchPanel/TouchPanel.h"
#include "stm32f4xx.h"
#include <stdio.h>
#include "YunzhouDLG.c"


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define Background_Task_PRIO    ( tskIDLE_PRIORITY  + 10 )
#define Background_Task_STACK   ( 512 )

#define Demo_Task_PRIO          ( tskIDLE_PRIORITY  + 9 )
#define Demo_Task_STACK         ( 3048 )

/* Private macro -------------------------------------------------------------*/
/* Private const -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
xTaskHandle                   Task_Handle;
xTaskHandle                   Demo_Handle;
xTimerHandle                  TouchScreenTimer;

//GPS绝对速度仪表盘指针
static GUI_POINT aPointArrow[] = {
{ 0, 0},
{ 2, 0},
{ 2, -30},
{ 0, -45},
{ -2, -30},
{ -2, 0},
};
GUI_POINT aEnlargedPoints[GUI_COUNTOF(aPointArrow)];

//水流相对速度仪表盘指针
static GUI_POINT difSpPointArrow[] = {
{ 0, 0},
{ 1, 0},
{ 1, -30},
{ 0, -45},
{ -1, -30},
{ -1, 0},
};
GUI_POINT difSpEnlargedPoints[GUI_COUNTOF(difSpPointArrow)];

//船内水温仪表盘指针
static GUI_POINT tempIPointArrow[] = {
{ 0, 0},
{ 1, 0},
{ 1, -12},
{ 0, -20},
{ -1, -12},
{ -1, 0},
};
GUI_POINT tempIEnlargedPoints[GUI_COUNTOF(tempIPointArrow)];

//船外水温仪表盘指针
static GUI_POINT tempOPointArrow[] = {
{ 0, 0},
{ 1, 0},
{ 1, -12},
{ 0, -20},
{ -1, -12},
{ -1, 0},
};
GUI_POINT tempOEnlargedPoints[GUI_COUNTOF(tempOPointArrow)];

float mtheta = 0;								//GPS绝对速度指针转角
float mdelta = 0.031;
float difSp_theta = 0;					//水流相对速度指针转角
float difSp_delta = 0.031;
float inner_temp_theta = 0;					//船内温度
float inner_temp_delta = 0.031;
float outer_temp_theta = 0;					//船外温度
float outer_temp_delta = 0.031;

uint8_t USV_battery = 100;			//船体电量百分比
uint8_t Rem_battery = 100;			//遥控器电量百分比
uint8_t battery_delta = 1;			//电量展示DEMO变化量

uint8_t sample_bottle1 = 100;			//采样瓶1百分比
uint8_t sample_bottle2 = 100;
uint8_t sample_bottle3 = 100;
uint8_t sample_bottle4 = 100;

//uint32_t demo_mode = 0;

extern WM_HWIN  ALARM_hWin;

/* Private function prototypes -----------------------------------------------*/
static void Background_Task(void * pvParameters);
static void Demo_Task(void * pvParameters);
//static void vTimerCallback( xTimerHandle pxTimer );
extern void DEMO_Starup(void);
extern void DEMO_MainMenu(void);
extern void ALARM_BackgroundProcess (void);
int float_to_string(double data, char *str, u8 length, u8 unit, u8 * prechar, u8 prelength);

/* Private functions ---------------------------------------------------------*/
static void cbMeterPointWin(WM_MESSAGE* pMsg) {
	switch (pMsg->MsgId) {
		case WM_PAINT:
//			GUI_SetBkColor(GUI_TRANSPARENT);
//			GUI_Clear();
		
//			GUI_DrawGradientH(0, 0, 30, 30, 0x0000FF, 0x00FFFF);

			printf("window notice: WM_PAINT. \n");
		
			break;
			
//		case WM_TIMER:

//		
////			printf("window timer activates. \n");
//			
//			WM_RestartTimer(pMsg->Data.v, 100);
//			break;
		
		default:
			WM_DefaultProc(pMsg);
	}
}

/**3

  * @brief  Retargets the C library printf function to the USART.
  * @param  None
  * @retval None
  */
int fputc(int ch, FILE *f)
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  USART_SendData(USART1, (uint8_t) ch);

  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
  {}

  return ch;
}

void mCOMInit(void)
{
	USART_InitTypeDef USART_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  /* USARTx configured as follows:
        - BaudRate = 115200 baud  
        - Word Length = 8 Bits
        - One Stop Bit
        - No parity
        - Hardware flow control disabled (RTS and CTS signals)
        - Receive and transmit enabled
  */
  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

/* Enable GPIO clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOA, ENABLE);

	/* Enable UART clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  /* Connect PXx to USARTx_Tx*/
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);

  /* Connect PXx to USARTx_Rx*/
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);

  /* Configure USART Tx as alternate function  */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Configure USART Rx as alternate function  */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* USART configuration */
  USART_Init(USART1, &USART_InitStructure);
    
  /* Enable USART */
  USART_Cmd(USART1, ENABLE);
}

