RuanJG/stm32_can_gps_hcm6343/Project/Yunzhou_remote(V1.1)/Core/User/main.c
void mdelay(uint32_t timer)
{
	while(timer--);
}

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */ 
int main(void)
{ 
//   GPIO_InitTypeDef GPIO_InitStructure;

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	 
	/* Setup SysTick Timer for 1 msec interrupts.*/
	if (SysTick_Config(SystemCoreClock / 1000))
	{ 
	 /* Capture error */ 
	 while (1);
	}
   
	mCOMInit();
  
  /* Create background task */
  xTaskCreate(Background_Task,
              (signed char const*)"BK_GND",
              Background_Task_STACK,
              NULL,
              Background_Task_PRIO,
              &Task_Handle);
							
//  /* Create demo task */
//  xTaskCreate(Demo_Task,
//              (signed char const*)"GUI_DEMO",
//              Demo_Task_STACK,
//              NULL,
//              Demo_Task_PRIO,
//              &Demo_Handle);

//   LowLevel_Init();
//   
//   /* Init the STemWin GUI Library */
//   GUI_Init();
//   GUI_DispStringAt("Hello world!", 0, 0);  	
//   GUI_SetBkColor(GUI_TRANSPARENT);
//   GUI_SelectLayer(1);
//   GUI_Clear();
//   GUI_SetBkColor(GUI_TRANSPARENT); 
//   GUI_SelectLayer(0);	
	

  /* Start the FreeRTOS scheduler */
  vTaskStartScheduler();
}


/**
  * @brief  Background task
  * @param  pvParameters not used
  * @retval None
  */
static void Background_Task(void * pvParameters)
{   
  GUI_MEMDEV_Handle bg1_memdev, bg0_memdev, bg0s_memdev, bg1w_memdev;
	uint8_t pointi = 0, tempi = 0, difSp_active = 0;
	uint16_t pointi2 = 0;
	char tempChar[20];
	uint32_t colorTemp;				//暂存颜色
	
	/* Initialize the BSP layer */
  LowLevel_Init();
	
  /* Init the STemWin GUI Library */
  GUI_Init(); 
  GUI_SetBkColor(GUI_TRANSPARENT);
  GUI_SelectLayer(1);
  GUI_Clear();
  GUI_SetBkColor(GUI_TRANSPARENT); 
  GUI_SelectLayer(0);
//	GUI_EnableAlpha(1);	
	
	GUI_RotatePolygon(aPointArrow, aPointArrow, GUI_COUNTOF(aPointArrow), 2);
	GUI_RotatePolygon(difSpPointArrow, difSpPointArrow, GUI_COUNTOF(difSpPointArrow), 2);
	GUI_RotatePolygon(tempIPointArrow, tempIPointArrow, GUI_COUNTOF(tempIPointArrow), 2);
	GUI_RotatePolygon(tempOPointArrow, tempOPointArrow, GUI_COUNTOF(tempOPointArrow), -2);
	
	mtheta = 0;
	difSp_theta = 0;
	difSp_delta = 0.031;

//	WM_SelectWindow(mFloatP);		
//	GUI_SelectLayer(1);	
//	GUI_RotatePolygon(difSpEnlargedPoints, difSpPointArrow, GUI_COUNTOF(difSpPointArrow), difSp_theta);
//	GUI_SetColor(GUI_BLUE);
//	GUI_FillPolygon (difSpEnlargedPoints, GUI_COUNTOF(difSpPointArrow), 64, 62);	

	GUI_BMP_Draw(_acImage_0, 358, 226);				//Yunzhou logo
	GUI_BMP_Draw(_acImage_1, 382, 0);					//GPS Rader
	GUI_BMP_Draw(_acImage_2, 6, 201);					//Boat picture
	
//	GUI_BMP_Draw(_acImage_3, 78, 200);				//Status board
	GUI_SetFont(&GUI_Font13_ASCII);
	GUI_SetBkColor(GUI_TRANSPARENT);
	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_RED);
	GUI_DispStringAt("Status:", 12 + 20, 176 + 7);
	
	GUI_BMP_Draw(_acImage_4, 13, 16 + 10);					//Temperature left board
	GUI_DispStringAt("100", 12, 10 + 10);
	GUI_DispStringAt("-40", 33, 83 + 10);
	GUI_DispStringAt("I", 33 + 20, 83 + 10 - 11);

	GUI_BMP_Draw(_acImage_5, 84, 16 + 10);					//Temperature right board 
	GUI_DispStringAt("100", 97, 10 + 10);	
	GUI_DispStringAt("-40", 78, 83 + 10);
	GUI_DispStringAt("W", 78 - 10, 83 + 10 - 11);
	
	GUI_BMP_Draw(_acImage_6, 52, 20);					//Temperature logo
	
	GUI_BMP_Draw(_acImage_7, 179, 11);				//USV Banner
	GUI_SelectLayer(1);
	GUI_SetFont(&GUI_Font20_ASCII);
	GUI_SetBkColor(GUI_TRANSPARENT);
	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_YELLOW);
	GUI_DispStringAt("ESM 30", 241, 25);
	
	GUI_SelectLayer(0);	
	GUI_BMP_Draw(_acImage_8, 120, 49);				//Dashboard 
	//MPH单位
	GUI_SetFont(&GUI_Font13_ASCII);
	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_YELLOW);	
	GUI_DispStringAt("MPH", 242, 136);	
	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_RED);	
	GUI_DispStringAt("G", 242 - 20, 136);
	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_BLUE);	
	GUI_DispStringAt("W", 242 + 20, 136);	
	
	//刻度
	GUI_SetColor(GUI_WHITE);	
	GUI_DispStringAt("0", 205, 128);
	GUI_DispStringAt("4", 204, 103);
	GUI_DispStringAt("8", 222, 83);
	GUI_DispStringAt("12", 242, 79);
	GUI_SetColor(GUI_RED);	
	GUI_DispStringAt("16", 261, 92);
	GUI_DispStringAt("20", 270, 116);
  
	GUI_BMP_Draw(_acImage_9, 40, 115);				//Battery Banner1
	GUI_BMP_Draw(_acImage_10, 40, 145);				//Battery Banner2
	GUI_SetFont(&GUI_Font13_ASCII);
	GUI_SetBkColor(GUI_TRANSPARENT);
//	GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	GUI_SetColor(GUI_RED);
	GUI_DispStringAt("Power:", 12, 105);	
	GUI_DispStringAt("USV:", 12, 124);
	GUI_DispStringAt("REM:", 12, 154);
	
	GUI_BMP_Draw(_acImage_11, 377, 112);				//Sample bottle
	GUI_DispStringAt("Sample volume", 372, 105);	
	
	GUI_BMP_Draw(_acImage_12, 364, 176);				//Alarm lamb
	GUI_BMP_Draw(_acImage_13, 438, 178);				//Nuclear
	GUI_BMP_Draw(_acImage_14, 400, 176);				//Light
	GUI_BMP_Draw(_acImage_15, 198, 228);				//Menu bar
	
	GUI_SelectLayer(1);	
	bg1_memdev = GUI_MEMDEV_Create(0, 0, 90, 90);
	bg1w_memdev = GUI_MEMDEV_Create(0, 0, 39, 43);
//	bg1w_memdev = GUI_MEMDEV_CreateFixed(0, 0, 35, 43, GUI_MEMDEV_HASTRANS, GUI_MEMDEV_APILIST_32, GUI_COLOR_CONV_8888);
	GUI_SelectLayer(0);	
	bg0_memdev = GUI_MEMDEV_Create(0, 0, 90, 90);
	bg0s_memdev = GUI_MEMDEV_Create(0, 0, 58, 14);
//	bg1_memdev = GUI_MEMDEV_CreateFixed(0, 0, 90, 90, GUI_MEMDEV_HASTRANS, GUI_MEMDEV_APILIST_32, GUI_COLOR_CONV_8888);
	
  /* Run the background task */
  while (1)
  {			
		pointi++;
		
		if(pointi >= 10)
		{
			pointi = 0;
			
			//模拟显示读数修改
			if(mtheta > -0.03)
				mdelta = -mdelta;
			
			else if(mtheta <= -4)
				mdelta = -mdelta;	
			
			mtheta += mdelta;
			
			if(mtheta < -2)
				difSp_active = 1;			
			
			if(difSp_active == 1)
			{			
				if(difSp_theta > -0.03)
					difSp_delta = -difSp_delta;
				
				else if(difSp_theta <= -4)
					difSp_delta = -difSp_delta;	

				difSp_theta = difSp_theta + difSp_delta;	
			}
			
			GUI_SelectLayer(1);
			//在存储设备写入新内容前清空存储区
			GUI_MEMDEV_Select(bg1_memdev);
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(0, 0, 90, 90);
			
			//旋转GPS船速指针
			GUI_RotatePolygon(aEnlargedPoints, aPointArrow, GUI_COUNTOF(aPointArrow), mtheta);
			GUI_SetColor(GUI_RED);
			GUI_FillPolygon (aEnlargedPoints, GUI_COUNTOF(aPointArrow), 45, 45);
			
			//旋转水流相对船速指针
			GUI_RotatePolygon(difSpEnlargedPoints, difSpPointArrow, GUI_COUNTOF(difSpPointArrow), difSp_theta);
			GUI_SetColor(GUI_BLUE);
			GUI_FillPolygon (difSpEnlargedPoints, GUI_COUNTOF(difSpPointArrow), 45, 45);			

			//中心圆点
			for(tempi = 1; tempi < 6; tempi++)
			{
				GUI_SetColor(GUI_YELLOW / tempi);
				GUI_DrawCircle(45, 45, tempi);
			}	
						
