RuanJG/stm32_can_gps_hcm6343/Project/Yunzhou_remote(V1.1)/Core/User/main.c
			//显示GPS船速数值
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_RED);
			float_to_string(-mtheta * 22 / 4, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 30, 79);
			
			//显示水流相对船速数值
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_BLUE);
			float_to_string(-difSp_theta * 22 / 4, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 60, 79);

			//将存储设备的暂存显存写入LCD缓冲区
			GUI_MEMDEV_CopyToLCDAt(bg1_memdev, 197, 70);
			
			//电池电量展示-------------------------------------------------------------
			//在存储设备写入新内容前清空存储区
			GUI_MEMDEV_Select(bg1_memdev);
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(0, 0, 90, 90);

			if(USV_battery >= 100)
			{
				battery_delta = -battery_delta;
			}
			else if(USV_battery == 0)
			{
				battery_delta = -battery_delta;
			}
			
			USV_battery += battery_delta;
			Rem_battery += battery_delta;
			
			if(USV_battery >= 40)
				colorTemp = GUI_GREEN;
			else if(USV_battery >= 20)
				colorTemp = GUI_ORANGE;
			else 
				colorTemp = GUI_RED;			
			
			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0_memdev);
			GUI_MEMDEV_Clear(bg0_memdev);			
			//无人船电量条
			GUI_DrawGradientV(1, 1, 45 * USV_battery / 100, 9, GUI_GRAY, colorTemp);
			GUI_DrawGradientV(1, 10, 45 * USV_battery / 100, 18, colorTemp, GUI_GRAY);
			GUI_DrawGradientV(1 + 45 * USV_battery / 100, 1, 45, 9, GUI_GRAY, GUI_WHITE);
			GUI_DrawGradientV(1 + 45 * USV_battery / 100, 10, 45, 18, GUI_WHITE, GUI_GRAY);	
			
			//遥控器电量条
			GUI_DrawGradientV(1, 32, 45 * Rem_battery / 100, 40, GUI_GRAY, colorTemp);
			GUI_DrawGradientV(1, 41, 45 * Rem_battery / 100, 49, colorTemp, GUI_GRAY);
			GUI_DrawGradientV(1 + 45 * Rem_battery / 100, 32, 45, 40, GUI_GRAY, GUI_WHITE);
			GUI_DrawGradientV(1 + 45 * Rem_battery / 100, 41, 45, 49, GUI_WHITE, GUI_GRAY);				
			
			GUI_MEMDEV_CopyToLCDAt(bg0_memdev, 50, 115);			
			
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1_memdev);
			//显示无人船电量									
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_BLACK);
			GUI_SetBkColor(GUI_TRANSPARENT);
			float_to_string(USV_battery, tempChar, 0, 1, 0, 0);
			GUI_DispStringAt(tempChar, 26, 10);	

			//显示遥控器电量
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_BLACK);
			GUI_SetBkColor(GUI_TRANSPARENT);
			float_to_string(Rem_battery, tempChar, 0, 1, 0, 0);
			GUI_DispStringAt(tempChar, 26, 41);				

			GUI_MEMDEV_CopyToLCDAt(bg1_memdev, 50, 115);
			
			//采样瓶容量展示-----------------------------------------------------------
			//在存储设备写入新内容前清空存储区
			sample_bottle1 += battery_delta;
			sample_bottle2 += battery_delta;
			sample_bottle3 += battery_delta;
			sample_bottle4 += battery_delta;

			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0_memdev);	
			GUI_MEMDEV_Clear(bg0_memdev);					
			//1号瓶采样容量
			GUI_DrawGradientH(1, 0, 8, 31 - 31 * sample_bottle1 / 100, 0x00b0b0b0, GUI_WHITE);
			GUI_DrawGradientH(9, 0, 17, 31 - 31 * sample_bottle1 / 100, GUI_WHITE, 0x00b0b0b0);
			GUI_DrawGradientH(1, 31 - 31 * sample_bottle1 / 100, 8, 31, 0x00b0b0b0, GUI_BLUE);
			GUI_DrawGradientH(9, 31 - 31 * sample_bottle1 / 100, 17, 31, GUI_BLUE, 0x00b0b0b0);
			
			//2号瓶采样容量
			GUI_DrawGradientH(1 + 21, 0, 8 + 21, 31 - 31 * sample_bottle2 / 100, 0x00b0b0b0, GUI_WHITE);
			GUI_DrawGradientH(9 + 21, 0, 17 + 21, 31 - 31 * sample_bottle2 / 100, GUI_WHITE, 0x00b0b0b0);
			GUI_DrawGradientH(1 + 21, 31 - 31 * sample_bottle2 / 100, 8 + 21, 31, 0x00b0b0b0, GUI_BLUE);
			GUI_DrawGradientH(9 + 21, 31 - 31 * sample_bottle2 / 100, 17 + 21, 31, GUI_BLUE, 0x00b0b0b0);		

			//3号瓶采样容量
			GUI_DrawGradientH(1 + 42, 0, 8 + 42, 31 - 31 * sample_bottle2 / 100, 0x00b0b0b0, GUI_WHITE);
			GUI_DrawGradientH(9 + 42, 0, 17 + 42, 31 - 31 * sample_bottle2 / 100, GUI_WHITE, 0x00b0b0b0);
			GUI_DrawGradientH(1 + 42, 31 - 31 * sample_bottle2 / 100, 8 + 42, 31, 0x00b0b0b0, GUI_BLUE);
			GUI_DrawGradientH(9 + 42, 31 - 31 * sample_bottle2 / 100, 17 + 42, 31, GUI_BLUE, 0x00b0b0b0);	
			
			//4号瓶采样容量
			GUI_DrawGradientH(1 + 63, 0, 8 + 63, 31 - 31 * sample_bottle2 / 100, 0x00b0b0b0, GUI_WHITE);
			GUI_DrawGradientH(9 + 63, 0, 17 + 63, 31 - 31 * sample_bottle2 / 100, GUI_WHITE, 0x00b0b0b0);
			GUI_DrawGradientH(1 + 63, 31 - 31 * sample_bottle2 / 100, 8 + 63, 31, 0x00b0b0b0, GUI_BLUE);
			GUI_DrawGradientH(9 + 63, 31 - 31 * sample_bottle2 / 100, 17 + 63, 31, GUI_BLUE, 0x00b0b0b0);	
			
			GUI_MEMDEV_CopyToLCDAt(bg0_memdev, 378, 127);
			
			//1号瓶数值
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1_memdev);	
			GUI_MEMDEV_Clear(bg1_memdev);	
			GUI_SetFont(&GUI_Font8_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_BLACK);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("1#", 10, 22);	
			float_to_string(sample_bottle1 * 4.0 / 100, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 3, 8);	

			//2号瓶数值
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_DispStringAt("2#", 10 + 21, 22);	
			float_to_string(sample_bottle2 * 4.0 / 100, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 3 + 21, 8);	
			
			//3号瓶数值
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_DispStringAt("3#", 10 + 42, 22);	
			float_to_string(sample_bottle3 * 4.0 / 100, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 3 + 42, 8);	
			
			//4号瓶数值
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_DispStringAt("4#", 10 + 63, 22);	
			float_to_string(sample_bottle4 * 4.0 / 100, tempChar, 1, 0, 0, 0);
			GUI_DispStringAt(tempChar, 3 + 63, 8);	
			
			GUI_MEMDEV_CopyToLCDAt(bg1_memdev, 378, 127);
			
			//显示船体状态信息---------------------------------------------------
			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0s_memdev);	
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_TOP);
			GUI_SetColor(GUI_RED);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("Not connect", 2, 2);	
			
