RuanJG/stm32_can_gps_hcm6343/Project/Yunzhou_remote(V1.1)/Core/User/main.c
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 24 + 2, 188);
			
			//显示左下方状态信息--------------------------------------------------
			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0_memdev);	
			GUI_MEMDEV_Clear(bg0_memdev);	
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_TOP);
			GUI_SetColor(GUI_RED);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("LM: 0%", 21, 0);	
			GUI_DispStringAt("CH: NC", 21, 0 + 15);
			GUI_DispStringAt("GPSR:", 21, 50);
			GUI_SetFont(&GUI_Font8_ASCII);
			GUI_DispStringAt("N: 23.266", 21 + 8, 50 + 12 + 4);
			GUI_DispStringAt("E: 120.688", 21 + 8, 50 + 24 + 4);
			
			GUI_MEMDEV_CopyToLCDAt(bg0_memdev, 104, 170);
			
			//显示右下方状态信息-------------------------------------------------
			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0s_memdev);	
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_TOP);
			GUI_SetColor(GUI_RED);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("RM: 0%", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299, 170 + 0);
			
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_DispStringAt("MCL: 100%", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299, 185 + 0);	
			
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_DispStringAt("GPSU:", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299, 185 + 30 + 3);
			
			GUI_MEMDEV_Clear(bg0s_memdev);
			GUI_SetFont(&GUI_Font8_ASCII);
			GUI_DispStringAt("N: 23.268", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299 + 6, 185 + 30 + 12 + 7);
			
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_DispStringAt("E: 120.568", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299 + 6, 185 + 30 + 24 + 7);
			
			//显示遥控控制加速度数值----------------------------------------------
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_SetFont(&GUI_Font13_ASCII);
			GUI_DispStringAt("LC: 0%", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 115 + 10, 48);

			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_DispStringAt("RC: 0%", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 299 + 10, 48);		

			//显示双GPS间距离------------------------------------------------------
			GUI_MEMDEV_Clear(bg0s_memdev);	
			GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_TOP);
			GUI_DispStringAt("0m", 2, 2);				
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 362 + 10, 13);			
			
			//显示船内外温度信息---------------------------------------------------
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1_memdev);	
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(0, 0, 90, 90);

			//旋转船内温度指针
			if(inner_temp_theta > 0.8)
				inner_temp_delta = -inner_temp_delta;
			
			else if(inner_temp_theta <= -1.6)
				inner_temp_delta = -inner_temp_delta;	
			
			inner_temp_theta += inner_temp_delta;	

			GUI_RotatePolygon(tempIEnlargedPoints, tempIPointArrow, GUI_COUNTOF(tempIPointArrow), inner_temp_theta);
			GUI_SetColor(GUI_RED);
			GUI_FillPolygon (tempIEnlargedPoints, GUI_COUNTOF(tempIPointArrow), 31, 57);		

			//旋转船外温度指针
			if(outer_temp_theta > 1.6)
				outer_temp_delta = -outer_temp_delta;
			
			else if(outer_temp_theta <= -0.8)
				outer_temp_delta = -outer_temp_delta;	
			
			outer_temp_theta += outer_temp_delta;	

			GUI_RotatePolygon(tempOEnlargedPoints, tempOPointArrow, GUI_COUNTOF(tempOPointArrow), outer_temp_theta);
			GUI_SetColor(GUI_RED);
			GUI_FillPolygon (tempOEnlargedPoints, GUI_COUNTOF(tempOPointArrow), 31 + 30, 57);	

			GUI_MEMDEV_CopyToLCDAt(bg1_memdev, 18, 0);
			
			//显示船内外温度读数数值
			GUI_SelectLayer(0);
			GUI_MEMDEV_Select(bg0s_memdev);	
//			GUI_MEMDEV_Clear(bg0s_memdev);
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(1, 1, 57, 13);			

			//船内温度数值
			GUI_SetFont(&GUI_Font8_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_TOP);
			
			if(((-inner_temp_theta + 0.8) * 160 / 2.4 - 40) > -10 && ((-inner_temp_theta + 0.8) * 160 / 2.4 - 40) < 60)
				GUI_SetColor(GUI_GREEN);
			else if(((-inner_temp_theta + 0.8) * 160 / 2.4 - 40) >= 60)
				GUI_SetColor(GUI_RED);
			else if(((-inner_temp_theta + 0.8) * 160 / 2.4 - 40) <= -10)
				GUI_SetColor(GUI_BLUE);
			
			GUI_SetBkColor(GUI_TRANSPARENT);			
			float_to_string(((-inner_temp_theta + 0.8) * 160 / 2.4 - 40), tempChar, 0, 0, 0, 0);
			GUI_DispStringAt(tempChar, 10, 1);		

			//船外温度数值
			GUI_SetFont(&GUI_Font8_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_TOP);
			
			if(((outer_temp_theta + 0.8) * 160 / 2.4 - 40) >= 60)
				GUI_SetColor(GUI_RED);
			else if(((outer_temp_theta + 0.8) * 160 / 2.4 - 40) <= -10)
				GUI_SetColor(GUI_BLUE);
			else
				GUI_SetColor(GUI_GREEN);
			
			float_to_string(((outer_temp_theta + 0.8) * 160 / 2.4 - 40), tempChar, 0, 0, 0, 0);
			GUI_DispStringAt(tempChar, 33, 1);				
			
			GUI_MEMDEV_CopyToLCDAt(bg0s_memdev, 42, 62);
			
			//模式，菜单及推进器方向-------------------------------------------------------------
			//在存储设备写入新内容前清空存储区
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1_memdev);
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(0, 0, 90, 90);
			
			GUI_SetFont(&GUI_Font20B_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_RED);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("Dual", 45, 50);	

			GUI_SetFont(&GUI_Font13B_ASCII);
			GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
			GUI_SetColor(GUI_RED);
			GUI_SetBkColor(GUI_TRANSPARENT);
			GUI_DispStringAt("MENU", 50, 76);						
			
			GUI_MEMDEV_CopyToLCDAt(bg1_memdev, 197, 167);
		}
		
		//警示图标展示-----------------------------------------------------------------------
		pointi2++;
		
		if((pointi2 > 100) && (pointi2 < 200))
		{
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1w_memdev);	
			GUI_SetColor(GUI_BLACK);
			GUI_FillRect(0, 0, 39, 43);	
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 361, 173);
			printf("1\n");
		}
		else if(pointi2 > 200 && pointi2 < 300)
		{
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1w_memdev);	
			GUI_SetColor(GUI_BLACK);
			GUI_FillRect(0, 0, 39, 43);	
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 398, 173);	
			printf("2\n");
		}
		else if((pointi2 > 300) && (pointi2 < 400))
		{
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1w_memdev);	
			GUI_SetColor(GUI_BLACK);
			GUI_FillRect(0, 0, 39, 43);	
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 438, 173);	
			printf("3\n");
		}
		else if(pointi2 >= 400)
		{
			pointi2 = 0;
			GUI_SelectLayer(1);
			GUI_MEMDEV_Select(bg1w_memdev);	
			GUI_SetColor(GUI_TRANSPARENT);
			GUI_FillRect(0, 0, 39, 43);
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 361, 173);
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 398, 173);				
			GUI_MEMDEV_CopyToLCDAt(bg1w_memdev, 438, 173);
			printf("4\n");
		}
			

		//触摸屏坐标更新
		ExecTouch();
		
		
		
		
